#include "config_setting.h"

/****************************************************************************
* 名    称: Init_Watchdog()
* 功    能: 设置看门狗 
* 入口参数: 无             
* 出口参数: 无
****************************************************************************/
void Init_Watchdog(void) 
{ 
    WDCTL = 0x00;       //打开IDLE才能设置看门狗
    WDCTL |= 0x08;      //定时器间隔选择,间隔一秒
}

/****************************************************************************
* 名    称: FeetDog()
* 功    能: 设置看门狗 
* 入口参数: 无             
* 出口参数: 无
****************************************************************************/
void FeetDog(void) 
{ 
    WDCTL = 0xa0;       //清除定时器。当0xA跟随0x5写到这些位，定时器被清除
    WDCTL = 0x50; 
    LED2 = 1;           //系统不复位LED2灯长亮
}


