#include "hold.h"

/****************************************************************************
* 名    称: SysPowerMode()
* 功    能: 设置系统工作模式
* 入口参数: mode等于0为PM0 1为PM1 2为PM2 3为PM3             
* 出口参数: 无
****************************************************************************/
void SysPowerMode(uchar mode) 
{ 
    if(mode < 4) 
    {  
        SLEEPCMD |= mode;    //设置系统睡眠模式 
        PCON = 0x01;         //进入睡眠模式 ,通过中断唤醒
    } 
    else 
        PCON = 0x00;         //通过中断唤醒系统 
}

/****************************************************************************
* 名    称: SysPowerMode()
* 功    能: 初始化休眠定时器,设定后经过指定时间自行唤醒
* 入口参数:             
* 出口参数: 无
****************************************************************************/
void InitSleepTimer(void) 
{ 
    ST2 = 0X00; 
    ST1 = 0X0F; 
    ST0 = 0X0F; 
    EA = 1;     //开中断 
    STIE = 1;   //睡眠定时器中断使能 0： 中断禁止     1： 中断使能
    STIF = 0;   //睡眠定时器中断标志 0： 无中断未决   1： 中断未决
}

/****************************************************************************
* 名    称: Set_ST_Period()
* 功    能: 设置睡眠时间 
* 入口参数: sec 睡眠时间             
* 出口参数: 无
****************************************************************************/
void Set_ST_Period(uint sec) 
{ 
    ulong sleepTimer = 0; 
    
    sleepTimer |= ST0; 
    sleepTimer |= (ulong)ST1 <<  8; 
    sleepTimer |= (ulong)ST2 << 16; 
    sleepTimer += ((ulong)sec * (ulong)32768); //低速频率为32.768KHZ,故每秒定时器计数32768次如果低速时钟为32K呢    
    ST2 = (uchar)(sleepTimer >> 16); 
    ST1 = (uchar)(sleepTimer >> 8); 
    ST0 = (uchar) sleepTimer; 
    
    //把加N秒的计数值赋给ST2:ST1:ST0 
    // 配置完毕后 sleepTimer 与 ST2<<16|ST1<<8|ST0 相差即为睡眠秒数 
}

/****************************************************************************
* 名    称: ST_ISR(void) 中断处理函数 
* 描    述: #pragma vector = 中断向量，紧接着是中断处理程序
****************************************************************************/
#pragma vector = ST_VECTOR 
__interrupt void ST_ISR(void) 
{ 
    STIF = 0;          //清标志位
    SysPowerMode(4);   //进入正常工作模式
}


