#include "led.h"

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时，系统时钟不配置时默认为16M(用示波器测量相当精确)
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}
/****************************************************************************
* 名    称: LedOnOrOff()
* 功    能: 点亮或熄灭所有LED灯    
* 入口参数: mode为1时LED灯亮  mode为0时LED灯灭， 共阴极
* 出口参数: 无
****************************************************************************/
void LedOnOrOff(uint mode)
{
    LED1 = mode;
    LED2 = mode;
    LED3 = mode;
}

/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED灯相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitLed(void)
{
    P1DIR |= 0x13;      //P1.0、P1.1定义为输出
    P0DIR |= 0x02;      //P0.1定义为输出
    LedOnOrOff(0);      //使所有LED灯默认为熄灭状态
}
/****************************************************************************
* 名    称: led_scan()
* 功    能: 灯的控制函数
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void led_scan(void)
{
	LED1 = !LED1;		  //流水灯，初始化时LED为熄灭执行后则点亮
	DelayMS(500);		  
	LED2 = !LED2;		  
	DelayMS(500);			 
	LED3 = !LED3;		 
	DelayMS(500);		  

	for (uint i=0; i<2; i++)	 //所有灯闪烁2次
	{
	   LedOnOrOff(0);	 //关闭所有LED灯
	   DelayMS(200);
	   LedOnOrOff(1);	 //打开所有LED灯
	   DelayMS(200);
	}

	LedOnOrOff(0);		 //使所有LED灯熄灭状态
	DelayMS(500);
}
