#include "timer.h"
#include "led.h"

/****************************************************************************
* 名 称: InitT1()
* 功 能: 定时器初始化，系统不配置工作时钟时默认是 2 分频，即 16MHz
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void Timer1_Init()
{
    T1CTL = 0x0d; //128 分频,自动重装 0x0000-0xFFFF
    T1STAT= 0x20; //通道 0,中断有效
}

/****************************************************************************
* 名 称: Timer3_Init()
* 功 能: 定时器初始化
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void Timer3_Init(void)
{
#if 0
    //系统不配置工作时钟时默认是 2 分频，即 16MHz
    T3CTL |= 0x08 ; //开溢出中断
    T3IE = 1;       //开总中断和 T3 中断
    T3CTL |= 0xE0;  //128 分频,128/16000000*N=0.5S,N=62500
    T3CTL &= ~0x03; //自动重装 00－>0xff 62500/255=245(次)
    T3CTL |= 0x10;  //启动
    EA= 1;          //开总中断
#else
    T3CCTL0 = 0x44;        //T3CCTL0 (0xCC)，CH0 中断使能，CH0 比较模式
    T3CC0 = 0xFA;          //T3CC0设置为250
    T3CTL |= 0x9A;         //启动T3计数器，计数时钟为16分频。使用MODULO模式
    IEN1 |= 0x08;     
    IEN0 |= 0x80;          //开总中断，开T3中断
#endif
}


#if 0
#pragma vector=T1_VECTOR
__interrupt void T1_ISR(void)
{ 
	static u8 count=0;
	
	count ++;
	if(count >32)
	{
		count =0;
		LED1 =!LED1;
	}
	IRCON &= ~(BIT(1));
}
#endif

#pragma vector = T3_VECTOR
__interrupt void T3_ISR(void)
{
    static uint count=0;
    T3IF = 0;         //清中断标志, 也可由硬件自动完成
    if(count++ > 100)     //245 次中断后 LED 取反，闪烁一轮（约为 0.5 秒时间）
    {                     //经过示波器测量确保精确
        count = 0;        //计数清零
        LED1 = ~LED1;     //改变 LED1 的状态
    }
}




